#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.aws_iam_policy_document.AmazonEKSClusterAssumeRolePolicy: Reading...
aws_eip.eip_01: Refreshing state... [id=eipalloc-055d2057a7f8eff17]
aws_iam_policy.AWSLoadBalancerControllerIAMPolicy: Refreshing state... [id=arn:aws:iam::318374019075:policy/earth-dev-AWSLoadBalancerControllerIAMPolicy]
aws_vpc.vpc: Refreshing state... [id=vpc-093f4e9a87fa69c1d]
aws_eip.eip_02: Refreshing state... [id=eipalloc-0c7eaa209f86d2906]
aws_iam_role.AmazonEKSNodeGroupRole: Refreshing state... [id=earth-dev-AmazonEKSNodeGroupRole]
data.aws_iam_policy_document.AmazonEKSClusterAssumeRolePolicy: Read complete after 0s [id=3552664922]
aws_iam_role.AmazonEKSClusterRole: Refreshing state... [id=earth-dev-AmazonEKSClusterRole]
aws_iam_role_policy_attachment.AmazonEKSVPCResourceController: Refreshing state... [id=earth-dev-AmazonEKSClusterRole-20231213060504973100000002]
aws_iam_role_policy_attachment.AmazonEKSClusterPolicy: Refreshing state... [id=earth-dev-AmazonEKSClusterRole-20231213060504971500000001]
aws_iam_role_policy_attachment.AmazonEC2ContainerRegistryReadOnly: Refreshing state... [id=earth-dev-AmazonEKSNodeGroupRole-20231213060505141700000004]
aws_iam_role_policy_attachment.AmazonEKSWorkerNodePolicy: Refreshing state... [id=earth-dev-AmazonEKSNodeGroupRole-20231213060504998400000003]
aws_security_group.allnodes-sg: Refreshing state... [id=sg-0bf376443ef00db46]
aws_subnet.public_subnet_02: Refreshing state... [id=subnet-0dd0433a76a0fd628]
aws_internet_gateway.internet_gateway: Refreshing state... [id=igw-0fde3298b9293d667]
aws_subnet.public_subnet_01: Refreshing state... [id=subnet-03d91045d2501f98c]
aws_subnet.private_subnet_02: Refreshing state... [id=subnet-0496c30684ab07305]
aws_security_group.cluster_sg: Refreshing state... [id=sg-05d87615d1c7f9f49]
aws_subnet.private_subnet_01: Refreshing state... [id=subnet-0f3f401edce626e8c]
aws_nat_gateway.nat_gateway_02: Refreshing state... [id=nat-03c6827dd59dd6e2d]
aws_route_table.public_route_table: Refreshing state... [id=rtb-077d1e853f3b729b3]
aws_nat_gateway.nat_gateway_01: Refreshing state... [id=nat-08f5cac1a85073e70]
aws_route_table.private_route_table_02: Refreshing state... [id=rtb-02b00e003b458274c]
aws_route_table_association.route_table_association_p02: Refreshing state... [id=rtbassoc-066e63290e3449271]
aws_route_table_association.route_table_association_p01: Refreshing state... [id=rtbassoc-0bcf223e0cccb38ec]
aws_eks_cluster.eks_cluster: Refreshing state... [id=earth-dev]
aws_route_table.private_route_table_01: Refreshing state... [id=rtb-09f3ca1c427fc8fab]
aws_route_table_association.route_table_association_i02: Refreshing state... [id=rtbassoc-08f229cbec65f27e1]
aws_route_table_association.route_table_association_i01: Refreshing state... [id=rtbassoc-02b21c36c52cac2ef]
aws_eks_identity_provider_config.oidc: Refreshing state... [id=earth-dev:earth-dev]
aws_eks_addon.vpc_cni: Refreshing state... [id=earth-dev:vpc-cni]
aws_eks_addon.kube_proxy: Refreshing state... [id=earth-dev:kube-proxy]
data.tls_certificate.eks_cluster: Reading...
aws_launch_template.app_node: Refreshing state... [id=lt-0049fc67511489bda]
aws_eks_node_group.app_node_group: Refreshing state... [id=earth-dev:app-node-group]
data.tls_certificate.eks_cluster: Read complete after 1s [id=d516f34410b983ad338645e4e1cb5bbfcdf5079b]
aws_iam_openid_connect_provider.eks_cluster: Refreshing state... [id=arn:aws:iam::318374019075:oidc-provider/oidc.eks.ap-northeast-2.amazonaws.com/id/7A81FC9B8F43BC93E2AB9C6CF6F110E0]
aws_eks_addon.aws-mountpoint-s3-csi-driver: Refreshing state... [id=earth-dev:aws-mountpoint-s3-csi-driver]
aws_eks_addon.coredns: Refreshing state... [id=earth-dev:coredns]
aws_eks_addon.aws_ebs_csi_driver: Refreshing state... [id=earth-dev:aws-ebs-csi-driver]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.AmazonEKSEBSCSIDriverAssumeRolePolicy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "AmazonEKSEBSCSIDriverAssumeRolePolicy" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "sts.amazonaws.com",
                ]
              + variable = "oidc.eks.ap-northeast-2.amazonaws.com/id/7A81FC9B8F43BC93E2AB9C6CF6F110E0:aud"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:kube-system:ebs-csi-controller-sa",
                ]
              + variable = "oidc.eks.ap-northeast-2.amazonaws.com/id/7A81FC9B8F43BC93E2AB9C6CF6F110E0:sub"
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # data.aws_iam_policy_document.AmazonEKSLoadBalancerControllerAssumeRolePolicy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "AmazonEKSLoadBalancerControllerAssumeRolePolicy" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "sts.amazonaws.com",
                ]
              + variable = "oidc.eks.ap-northeast-2.amazonaws.com/id/7A81FC9B8F43BC93E2AB9C6CF6F110E0:aud"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:kube-system:aws-load-balancer-controller",
                ]
              + variable = "oidc.eks.ap-northeast-2.amazonaws.com/id/7A81FC9B8F43BC93E2AB9C6CF6F110E0:sub"
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # data.aws_iam_policy_document.AmazonEKSVPCCNIAssumeRolePolicy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "AmazonEKSVPCCNIAssumeRolePolicy" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "sts.amazonaws.com",
                ]
              + variable = "oidc.eks.ap-northeast-2.amazonaws.com/id/7A81FC9B8F43BC93E2AB9C6CF6F110E0:aud"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:kube-system:aws-node",
                ]
              + variable = "oidc.eks.ap-northeast-2.amazonaws.com/id/7A81FC9B8F43BC93E2AB9C6CF6F110E0:sub"
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # data.aws_iam_policy_document.AmazonEKS_S3_CSI_DriverAssumeRolePolicy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "AmazonEKS_S3_CSI_DriverAssumeRolePolicy" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringLike"
              + values   = [
                  + "sts.amazonaws.com",
                ]
              + variable = "oidc.eks.ap-northeast-2.amazonaws.com/id/7A81FC9B8F43BC93E2AB9C6CF6F110E0:aud"
            }
          + condition {
              + test     = "StringLike"
              + values   = [
                  + "system:serviceaccount:kube-system:s3-csi-*",
                ]
              + variable = "oidc.eks.ap-northeast-2.amazonaws.com/id/7A81FC9B8F43BC93E2AB9C6CF6F110E0:sub"
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # aws_eks_addon.aws-mountpoint-s3-csi-driver is tainted, so must be replaced
-/+ resource "aws_eks_addon" "aws-mountpoint-s3-csi-driver" {
      ~ arn                  = "arn:aws:eks:ap-northeast-2:318374019075:addon/earth-dev/aws-mountpoint-s3-csi-driver/20c63114-d8d2-a515-a4bb-78dc2b0a4a79" -> (known after apply)
      + configuration_values = (known after apply)
      ~ created_at           = "2023-12-13T07:52:29Z" -> (known after apply)
      ~ id                   = "earth-dev:aws-mountpoint-s3-csi-driver" -> (known after apply)
      ~ modified_at          = "2023-12-13T07:52:29Z" -> (known after apply)
      - tags                 = {} -> null
        # (4 unchanged attributes hidden)
    }

  # aws_eks_addon.aws_ebs_csi_driver is tainted, so must be replaced
-/+ resource "aws_eks_addon" "aws_ebs_csi_driver" {
      ~ arn                  = "arn:aws:eks:ap-northeast-2:318374019075:addon/earth-dev/aws-ebs-csi-driver/d0c63114-e34b-7473-2f11-b1805e4072e1" -> (known after apply)
      + configuration_values = (known after apply)
      ~ created_at           = "2023-12-13T07:52:34Z" -> (known after apply)
      ~ id                   = "earth-dev:aws-ebs-csi-driver" -> (known after apply)
      ~ modified_at          = "2023-12-13T07:52:34Z" -> (known after apply)
      - tags                 = {} -> null
        # (4 unchanged attributes hidden)
    }

  # aws_eks_addon.coredns is tainted, so must be replaced
-/+ resource "aws_eks_addon" "coredns" {
      ~ arn                  = "arn:aws:eks:ap-northeast-2:318374019075:addon/earth-dev/coredns/00c63114-d8d3-57e5-31bd-00946387dcdb" -> (known after apply)
      + configuration_values = (known after apply)
      ~ created_at           = "2023-12-13T07:52:29Z" -> (known after apply)
      ~ id                   = "earth-dev:coredns" -> (known after apply)
      ~ modified_at          = "2023-12-13T07:52:29Z" -> (known after apply)
      - tags                 = {} -> null
        # (4 unchanged attributes hidden)
    }

  # aws_iam_openid_connect_provider.eks_cluster is tainted, so must be replaced
-/+ resource "aws_iam_openid_connect_provider" "eks_cluster" {
      ~ arn             = "arn:aws:iam::318374019075:oidc-provider/oidc.eks.ap-northeast-2.amazonaws.com/id/7A81FC9B8F43BC93E2AB9C6CF6F110E0" -> (known after apply)
      ~ id              = "arn:aws:iam::318374019075:oidc-provider/oidc.eks.ap-northeast-2.amazonaws.com/id/7A81FC9B8F43BC93E2AB9C6CF6F110E0" -> (known after apply)
      - tags            = {} -> null
      ~ url             = "oidc.eks.ap-northeast-2.amazonaws.com/id/7A81FC9B8F43BC93E2AB9C6CF6F110E0" -> "https://oidc.eks.ap-northeast-2.amazonaws.com/id/7A81FC9B8F43BC93E2AB9C6CF6F110E0"
        # (3 unchanged attributes hidden)
    }

  # aws_iam_role.AmazonEKSLoadBalancerControllerRole will be created
  + resource "aws_iam_role" "AmazonEKSLoadBalancerControllerRole" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "earth-dev-AmazonEKSLoadBalancerControllerRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "dev"
          + "Name"        = "earth-dev"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role.AmazonEKSVPCCNIRole will be created
  + resource "aws_iam_role" "AmazonEKSVPCCNIRole" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "earth-dev-AmazonEKSVPCCNIRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "dev"
          + "Name"        = "earth-dev"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role.AmazonEKS_EBS_CSI_DriverRole will be created
  + resource "aws_iam_role" "AmazonEKS_EBS_CSI_DriverRole" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "earth-dev-AmazonEKS_EBS_CSI_DriverRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "dev"
          + "Name"        = "earth-dev"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role.AmazonEKS_S3_CSI_DriverRole will be created
  + resource "aws_iam_role" "AmazonEKS_S3_CSI_DriverRole" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "earth-dev-AmazonEKS_S3_CSI_DriverRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "dev"
          + "Name"        = "earth-dev"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.AWSLoadBalancerControllerIAMPolicy will be created
  + resource "aws_iam_role_policy_attachment" "AWSLoadBalancerControllerIAMPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::318374019075:policy/earth-dev-AWSLoadBalancerControllerIAMPolicy"
      + role       = "earth-dev-AmazonEKSLoadBalancerControllerRole"
    }

  # aws_iam_role_policy_attachment.AmazonEKS_CNI_Policy will be created
  + resource "aws_iam_role_policy_attachment" "AmazonEKS_CNI_Policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "earth-dev-AmazonEKSVPCCNIRole"
    }

  # aws_iam_role_policy_attachment.AmazonEKS_EBS_CSI_DriverPolicy will be created
  + resource "aws_iam_role_policy_attachment" "AmazonEKS_EBS_CSI_DriverPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEBSCSIDriverPolicy"
      + role       = "earth-dev-AmazonEKS_EBS_CSI_DriverRole"
    }

  # aws_iam_role_policy_attachment.AmazonEKS_S3_CSI_DriverPolicy will be created
  + resource "aws_iam_role_policy_attachment" "AmazonEKS_S3_CSI_DriverPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonS3CSIDriverPolicy"
      + role       = "earth-dev-AmazonEKS_S3_CSI_DriverRole"
    }

Plan: 12 to add, 0 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @jonghak-dev, Action: `pull_request`, Workflow: `Terraform apply`*